<h3> Base de dados de cr√©dito </h3>

In [5]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [6]:
df = pd.read_csv('credit-data.csv', sep=',')

In [7]:
list(df)

['clientid', 'income', 'age', 'loan', 'default']

In [8]:
df.sample()

    clientid        income        age         loan  default
72        73  33704.508496  33.183106  5898.000893        1

In [6]:
df.describe()

          clientid        income          age          loan      default
count  2000.000000   2000.000000  1997.000000   2000.000000  2000.000000
mean   1000.500000  45331.600018    40.807559   4444.369695     0.141500
std     577.494589  14326.327119    13.624469   3045.410024     0.348624
min       1.000000  20014.489470   -52.423280      1.377630     0.000000
25%     500.750000  32796.459717    28.990415   1939.708847     0.000000
50%    1000.500000  45789.117313    41.317159   3974.719419     0.000000
75%    1500.250000  57791.281668    52.587040   6432.410625     0.000000
max    2000.000000  69995.685578    63.971796  13766.051239     1.000000

In [7]:
correlacao = df.corr()''
correlacao.style.background_gradient(cmap='coolwarm')

In [22]:
df.loc[df['age']<0]

Empty DataFrame
Columns: [clientid, income, age, loan, default]
Index: []

In [12]:
df.drop(df[df.age < 0].index, inplace = True)

In [15]:
df['age'][df.age > 0].mean()

40.92770044906149

In [21]:
#Substituir os valores errados com idade negativa pela m√©dia
df.loc[df.age <0] = df['age'][df.age > 0].mean()

In [23]:
#H√° valofes nulos?
df.isnull().values.any()

True

In [24]:
#H√° valores nulos na idade
df.age.isnull().values.any()

True

In [50]:
#Quantos valores nulos h√° em cada coluna
df.isnull().sum(axis = 0)

clientid    0
income      0
age         3
loan        0
default     0
dtype: int64

In [28]:
df.loc[pd.isnull(df['age'])] = df['age'][df.age > 0].mean()

<h3> Separa√ß√£o do dataset em dois conjuntos </h3>

In [62]:
df.head()

   clientid        income        age         loan  default
0         1  66155.925095  59.017015  8106.532131        0
1         2  34415.153966  48.117153  6564.745018        0
2         3  57317.170063  63.108049  8020.953296        0
3         4  42709.534201  45.751972  6103.642260        0
4         5  66952.688845  18.584336  8770.099235        1

In [77]:
x_all = df.iloc[:,1:4].values

In [65]:
xdf = df.drop(['default'], axis = 1)
ydf = df['default']

In [40]:
y_all = df.iloc[:,4].values

<h3> Pr√©-processar os valores missing </h3>

In [41]:
from sklearn.preprocessing import Imputer

In [49]:
#Como mostrar apenas os valores missing de alguma feature
df.loc[pd.isnull(df['age'])]

    clientid        income  age         loan  default
28        29  59417.805406  NaN  2082.625938        0
30        31  48528.852796  NaN  6155.784670        0
31        32  23526.302555  NaN  2862.010139        0

In [52]:
imputer = Imputer(missing_values="NaN", strategy = 'mean', axis = 0)

In [66]:
#S√≥ vou aplicar o imputer sobre a feature age
imputer = imputer.fit(xdf)

In [70]:
xdf = pd.DataFrame(imputer.transform(xdf))

In [74]:
xdf.isnull().sum(axis = 0)

0    0
1    0
2    0
3    0
dtype: int64

<h3> Escalonamento dos atributos (Atrav√©s da padroniza√ß√£o) </h3>

In [83]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
xdf = pd.DataFrame(scaler.fit_transform(xdf))
xdf.sample(5)

             0         1         2         3
759  -0.416558  1.235388  1.157855 -0.488527
1970  1.680956  1.586032  0.505991 -0.138376
864  -0.234693 -1.639027  0.508066 -0.966849
1920  1.594353  1.307448  1.399684  0.436803
687  -0.541266 -0.202225  0.784813 -0.551160